#Каждый следующий элемент ряда Фибоначчи получается при сложении двух предыдущих. 
#Начиная с 1 и 2, первые 10 элементов будут:
#1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...
#Найдите сумму всех четных элементов ряда Фибоначчи, которые не превышают четыре миллиона.
#-----------------------------------------------------------
#Each new term in the Fibonacci sequence is generated by adding the previous two terms. 
#By starting with 1 and 2, the first 10 terms will be:
#1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...
#By considering the terms in the Fibonacci sequence whose values do not exceed four million, find the sum of the even-valued terms.

x = 0
y = 1
f = 0
summa = 0
while (x<2000000):
	f = x + y
	if (f%2 == 0):
		print(f)
		summa = summa + f
	x = y
	y = f
print("Sum Fibonacci = {}".format(summa))

#Sum Fibonacci = 4613732